{
  "version": "1.0",
  "truncation": null,
  "padding": null,
  "added_tokens": [
    {
      "id": 0,
      "content": "[PAD]",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 1,
      "content": "[BOS]",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 2,
      "content": "[EOS]",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 3,
      "content": "[MASK]",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 4,
      "content": "[UNK]",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    }
  ],
  "normalizer": {
    "type": "Sequence",
    "normalizers": [
      {
        "type": "NFD"
      }
    ]
  },
  "pre_tokenizer": {
    "type": "CharDelimiterSplit",
    "delimiter": " "
  },
  "post_processor": {
    "type": "TemplateProcessing",
    "single": [
      {
        "SpecialToken": {
          "id": "[BOS]",
          "type_id": 0
        }
      },
      {
        "Sequence": {
          "id": "A",
          "type_id": 0
        }
      },
      {
        "SpecialToken": {
          "id": "[EOS]",
          "type_id": 0
        }
      }
    ],
    "pair": [
      {
        "SpecialToken": {
          "id": "[BOS]",
          "type_id": 0
        }
      },
      {
        "Sequence": {
          "id": "A",
          "type_id": 0
        }
      },
      {
        "SpecialToken": {
          "id": "[SEP]",
          "type_id": 0
        }
      },
      {
        "Sequence": {
          "id": "B",
          "type_id": 1
        }
      },
      {
        "SpecialToken": {
          "id": "[EOS]",
          "type_id": 0
        }
      }
    ],
    "special_tokens": {
      "[BOS]": {
        "id": "[BOS]",
        "ids": [
          1
        ],
        "tokens": [
          "[BOS]"
        ]
      },
      "[EOS]": {
        "id": "[EOS]",
        "ids": [
          2
        ],
        "tokens": [
          "[EOS]"
        ]
      },
      "[SEP]": {
        "id": "[SEP]",
        "ids": [
          3
        ],
        "tokens": [
          "[SEP]"
        ]
      }
    }
  },
  "decoder": null,
  "model": {
    "type": "WordLevel",
    "vocab": {
      "[PAD]": 0,
      "[BOS]": 1,
      "[EOS]": 2,
      "[MASK]": 3,
      "[UNK]": 4,
      "Bar_None": 5,
      "Chord_A#:+": 6,
      "Chord_A#:/o7": 7,
      "Chord_A#:7": 8,
      "Chord_A#:M": 9,
      "Chord_A#:M7": 10,
      "Chord_A#:m": 11,
      "Chord_A#:m7": 12,
      "Chord_A#:o": 13,
      "Chord_A#:o7": 14,
      "Chord_A#:sus2": 15,
      "Chord_A#:sus4": 16,
      "Chord_A:+": 17,
      "Chord_A:/o7": 18,
      "Chord_A:7": 19,
      "Chord_A:M": 20,
      "Chord_A:M7": 21,
      "Chord_A:m": 22,
      "Chord_A:m7": 23,
      "Chord_A:o": 24,
      "Chord_A:o7": 25,
      "Chord_A:sus2": 26,
      "Chord_A:sus4": 27,
      "Chord_B:+": 28,
      "Chord_B:/o7": 29,
      "Chord_B:7": 30,
      "Chord_B:M": 31,
      "Chord_B:M7": 32,
      "Chord_B:m": 33,
      "Chord_B:m7": 34,
      "Chord_B:o": 35,
      "Chord_B:o7": 36,
      "Chord_B:sus2": 37,
      "Chord_B:sus4": 38,
      "Chord_C#:+": 39,
      "Chord_C#:/o7": 40,
      "Chord_C#:7": 41,
      "Chord_C#:M": 42,
      "Chord_C#:M7": 43,
      "Chord_C#:m": 44,
      "Chord_C#:m7": 45,
      "Chord_C#:o": 46,
      "Chord_C#:o7": 47,
      "Chord_C#:sus2": 48,
      "Chord_C#:sus4": 49,
      "Chord_C:+": 50,
      "Chord_C:/o7": 51,
      "Chord_C:7": 52,
      "Chord_C:M": 53,
      "Chord_C:M7": 54,
      "Chord_C:m": 55,
      "Chord_C:m7": 56,
      "Chord_C:o": 57,
      "Chord_C:o7": 58,
      "Chord_C:sus2": 59,
      "Chord_C:sus4": 60,
      "Chord_D#:+": 61,
      "Chord_D#:/o7": 62,
      "Chord_D#:7": 63,
      "Chord_D#:M": 64,
      "Chord_D#:M7": 65,
      "Chord_D#:m": 66,
      "Chord_D#:m7": 67,
      "Chord_D#:o": 68,
      "Chord_D#:o7": 69,
      "Chord_D#:sus2": 70,
      "Chord_D#:sus4": 71,
      "Chord_D:+": 72,
      "Chord_D:/o7": 73,
      "Chord_D:7": 74,
      "Chord_D:M": 75,
      "Chord_D:M7": 76,
      "Chord_D:m": 77,
      "Chord_D:m7": 78,
      "Chord_D:o": 79,
      "Chord_D:o7": 80,
      "Chord_D:sus2": 81,
      "Chord_D:sus4": 82,
      "Chord_E:+": 83,
      "Chord_E:/o7": 84,
      "Chord_E:7": 85,
      "Chord_E:M": 86,
      "Chord_E:M7": 87,
      "Chord_E:m": 88,
      "Chord_E:m7": 89,
      "Chord_E:o": 90,
      "Chord_E:o7": 91,
      "Chord_E:sus2": 92,
      "Chord_E:sus4": 93,
      "Chord_F#:+": 94,
      "Chord_F#:/o7": 95,
      "Chord_F#:7": 96,
      "Chord_F#:M": 97,
      "Chord_F#:M7": 98,
      "Chord_F#:m": 99,
      "Chord_F#:m7": 100,
      "Chord_F#:o": 101,
      "Chord_F#:o7": 102,
      "Chord_F#:sus2": 103,
      "Chord_F#:sus4": 104,
      "Chord_F:+": 105,
      "Chord_F:/o7": 106,
      "Chord_F:7": 107,
      "Chord_F:M": 108,
      "Chord_F:M7": 109,
      "Chord_F:m": 110,
      "Chord_F:m7": 111,
      "Chord_F:o": 112,
      "Chord_F:o7": 113,
      "Chord_F:sus2": 114,
      "Chord_F:sus4": 115,
      "Chord_G#:+": 116,
      "Chord_G#:/o7": 117,
      "Chord_G#:7": 118,
      "Chord_G#:M": 119,
      "Chord_G#:M7": 120,
      "Chord_G#:m": 121,
      "Chord_G#:m7": 122,
      "Chord_G#:o": 123,
      "Chord_G#:o7": 124,
      "Chord_G#:sus2": 125,
      "Chord_G#:sus4": 126,
      "Chord_G:+": 127,
      "Chord_G:/o7": 128,
      "Chord_G:7": 129,
      "Chord_G:M": 130,
      "Chord_G:M7": 131,
      "Chord_G:m": 132,
      "Chord_G:m7": 133,
      "Chord_G:o": 134,
      "Chord_G:o7": 135,
      "Chord_G:sus2": 136,
      "Chord_G:sus4": 137,
      "Duration_0.1.8": 138,
      "Duration_0.2.8": 139,
      "Duration_0.3.8": 140,
      "Duration_0.4.8": 141,
      "Duration_0.5.8": 142,
      "Duration_0.6.8": 143,
      "Duration_0.7.8": 144,
      "Duration_1.0.8": 145,
      "Duration_1.1.8": 146,
      "Duration_1.2.8": 147,
      "Duration_1.3.8": 148,
      "Duration_1.4.8": 149,
      "Duration_1.5.8": 150,
      "Duration_1.6.8": 151,
      "Duration_1.7.8": 152,
      "Duration_10.0.4": 153,
      "Duration_10.1.4": 154,
      "Duration_10.2.4": 155,
      "Duration_10.3.4": 156,
      "Duration_11.0.4": 157,
      "Duration_11.1.4": 158,
      "Duration_11.2.4": 159,
      "Duration_11.3.4": 160,
      "Duration_12.0.4": 161,
      "Duration_2.0.8": 162,
      "Duration_2.1.8": 163,
      "Duration_2.2.8": 164,
      "Duration_2.3.8": 165,
      "Duration_2.4.8": 166,
      "Duration_2.5.8": 167,
      "Duration_2.6.8": 168,
      "Duration_2.7.8": 169,
      "Duration_3.0.8": 170,
      "Duration_3.1.8": 171,
      "Duration_3.2.8": 172,
      "Duration_3.3.8": 173,
      "Duration_3.4.8": 174,
      "Duration_3.5.8": 175,
      "Duration_3.6.8": 176,
      "Duration_3.7.8": 177,
      "Duration_4.0.4": 178,
      "Duration_4.1.4": 179,
      "Duration_4.2.4": 180,
      "Duration_4.3.4": 181,
      "Duration_5.0.4": 182,
      "Duration_5.1.4": 183,
      "Duration_5.2.4": 184,
      "Duration_5.3.4": 185,
      "Duration_6.0.4": 186,
      "Duration_6.1.4": 187,
      "Duration_6.2.4": 188,
      "Duration_6.3.4": 189,
      "Duration_7.0.4": 190,
      "Duration_7.1.4": 191,
      "Duration_7.2.4": 192,
      "Duration_7.3.4": 193,
      "Duration_8.0.4": 194,
      "Duration_8.1.4": 195,
      "Duration_8.2.4": 196,
      "Duration_8.3.4": 197,
      "Duration_9.0.4": 198,
      "Duration_9.1.4": 199,
      "Duration_9.2.4": 200,
      "Duration_9.3.4": 201,
      "PAD_None": 202,
      "PitchDrum_27": 203,
      "PitchDrum_28": 204,
      "PitchDrum_29": 205,
      "PitchDrum_30": 206,
      "PitchDrum_31": 207,
      "PitchDrum_32": 208,
      "PitchDrum_33": 209,
      "PitchDrum_34": 210,
      "PitchDrum_35": 211,
      "PitchDrum_36": 212,
      "PitchDrum_37": 213,
      "PitchDrum_38": 214,
      "PitchDrum_39": 215,
      "PitchDrum_40": 216,
      "PitchDrum_41": 217,
      "PitchDrum_42": 218,
      "PitchDrum_43": 219,
      "PitchDrum_44": 220,
      "PitchDrum_45": 221,
      "PitchDrum_46": 222,
      "PitchDrum_47": 223,
      "PitchDrum_48": 224,
      "PitchDrum_49": 225,
      "PitchDrum_50": 226,
      "PitchDrum_51": 227,
      "PitchDrum_52": 228,
      "PitchDrum_53": 229,
      "PitchDrum_54": 230,
      "PitchDrum_55": 231,
      "PitchDrum_56": 232,
      "PitchDrum_57": 233,
      "PitchDrum_58": 234,
      "PitchDrum_59": 235,
      "PitchDrum_60": 236,
      "PitchDrum_61": 237,
      "PitchDrum_62": 238,
      "PitchDrum_63": 239,
      "PitchDrum_64": 240,
      "PitchDrum_65": 241,
      "PitchDrum_66": 242,
      "PitchDrum_67": 243,
      "PitchDrum_68": 244,
      "PitchDrum_69": 245,
      "PitchDrum_70": 246,
      "PitchDrum_71": 247,
      "PitchDrum_72": 248,
      "PitchDrum_73": 249,
      "PitchDrum_74": 250,
      "PitchDrum_75": 251,
      "PitchDrum_76": 252,
      "PitchDrum_77": 253,
      "PitchDrum_78": 254,
      "PitchDrum_79": 255,
      "PitchDrum_80": 256,
      "PitchDrum_81": 257,
      "PitchDrum_82": 258,
      "PitchDrum_83": 259,
      "PitchDrum_84": 260,
      "PitchDrum_85": 261,
      "PitchDrum_86": 262,
      "PitchDrum_87": 263,
      "Pitch_100": 264,
      "Pitch_101": 265,
      "Pitch_102": 266,
      "Pitch_103": 267,
      "Pitch_104": 268,
      "Pitch_105": 269,
      "Pitch_106": 270,
      "Pitch_107": 271,
      "Pitch_108": 272,
      "Pitch_21": 273,
      "Pitch_22": 274,
      "Pitch_23": 275,
      "Pitch_24": 276,
      "Pitch_25": 277,
      "Pitch_26": 278,
      "Pitch_27": 279,
      "Pitch_28": 280,
      "Pitch_29": 281,
      "Pitch_30": 282,
      "Pitch_31": 283,
      "Pitch_32": 284,
      "Pitch_33": 285,
      "Pitch_34": 286,
      "Pitch_35": 287,
      "Pitch_36": 288,
      "Pitch_37": 289,
      "Pitch_38": 290,
      "Pitch_39": 291,
      "Pitch_40": 292,
      "Pitch_41": 293,
      "Pitch_42": 294,
      "Pitch_43": 295,
      "Pitch_44": 296,
      "Pitch_45": 297,
      "Pitch_46": 298,
      "Pitch_47": 299,
      "Pitch_48": 300,
      "Pitch_49": 301,
      "Pitch_50": 302,
      "Pitch_51": 303,
      "Pitch_52": 304,
      "Pitch_53": 305,
      "Pitch_54": 306,
      "Pitch_55": 307,
      "Pitch_56": 308,
      "Pitch_57": 309,
      "Pitch_58": 310,
      "Pitch_59": 311,
      "Pitch_60": 312,
      "Pitch_61": 313,
      "Pitch_62": 314,
      "Pitch_63": 315,
      "Pitch_64": 316,
      "Pitch_65": 317,
      "Pitch_66": 318,
      "Pitch_67": 319,
      "Pitch_68": 320,
      "Pitch_69": 321,
      "Pitch_70": 322,
      "Pitch_71": 323,
      "Pitch_72": 324,
      "Pitch_73": 325,
      "Pitch_74": 326,
      "Pitch_75": 327,
      "Pitch_76": 328,
      "Pitch_77": 329,
      "Pitch_78": 330,
      "Pitch_79": 331,
      "Pitch_80": 332,
      "Pitch_81": 333,
      "Pitch_82": 334,
      "Pitch_83": 335,
      "Pitch_84": 336,
      "Pitch_85": 337,
      "Pitch_86": 338,
      "Pitch_87": 339,
      "Pitch_88": 340,
      "Pitch_89": 341,
      "Pitch_90": 342,
      "Pitch_91": 343,
      "Pitch_92": 344,
      "Pitch_93": 345,
      "Pitch_94": 346,
      "Pitch_95": 347,
      "Pitch_96": 348,
      "Pitch_97": 349,
      "Pitch_98": 350,
      "Pitch_99": 351,
      "Position_0": 352,
      "Position_1": 353,
      "Position_10": 354,
      "Position_11": 355,
      "Position_12": 356,
      "Position_13": 357,
      "Position_14": 358,
      "Position_15": 359,
      "Position_16": 360,
      "Position_17": 361,
      "Position_18": 362,
      "Position_19": 363,
      "Position_2": 364,
      "Position_20": 365,
      "Position_21": 366,
      "Position_22": 367,
      "Position_23": 368,
      "Position_24": 369,
      "Position_25": 370,
      "Position_26": 371,
      "Position_27": 372,
      "Position_28": 373,
      "Position_29": 374,
      "Position_3": 375,
      "Position_30": 376,
      "Position_31": 377,
      "Position_4": 378,
      "Position_5": 379,
      "Position_6": 380,
      "Position_7": 381,
      "Position_8": 382,
      "Position_9": 383,
      "Velocity_103": 384,
      "Velocity_107": 385,
      "Velocity_11": 386,
      "Velocity_111": 387,
      "Velocity_115": 388,
      "Velocity_119": 389,
      "Velocity_123": 390,
      "Velocity_127": 391,
      "Velocity_15": 392,
      "Velocity_19": 393,
      "Velocity_23": 394,
      "Velocity_27": 395,
      "Velocity_3": 396,
      "Velocity_31": 397,
      "Velocity_35": 398,
      "Velocity_39": 399,
      "Velocity_43": 400,
      "Velocity_47": 401,
      "Velocity_51": 402,
      "Velocity_55": 403,
      "Velocity_59": 404,
      "Velocity_63": 405,
      "Velocity_67": 406,
      "Velocity_7": 407,
      "Velocity_71": 408,
      "Velocity_75": 409,
      "Velocity_79": 410,
      "Velocity_83": 411,
      "Velocity_87": 412,
      "Velocity_91": 413,
      "Velocity_95": 414,
      "Velocity_99": 415,
      "[BOS]_None": 416,
      "[EOS]_None": 417,
      "[MASK]_None": 418,
      "[PAD]_None": 419
    },
    "unk_token": "[UNK]"
  }
}