{
  "version": "1.0",
  "truncation": null,
  "padding": null,
  "added_tokens": [
    {
      "id": 0,
      "content": "[MASK]",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 1,
      "content": "[PAD]",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 3,
      "content": "[BOS]",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 4,
      "content": "[EOS]",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 366,
      "content": "[UNK]",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    }
  ],
  "normalizer": null,
  "pre_tokenizer": null,
  "post_processor": null,
  "decoder": null,
  "model": {
    "type": "WordLevel",
    "vocab": {
      "[MASK]": 0,
      "[PAD]": 1,
      "[NONE]": 2,
      "[BOS]": 3,
      "[EOS]": 4,
      "Bar_None": 5,
      "Beat_0": 6,
      "Beat_1": 7,
      "Beat_10": 8,
      "Beat_11": 9,
      "Beat_12": 10,
      "Beat_13": 11,
      "Beat_14": 12,
      "Beat_15": 13,
      "Beat_2": 14,
      "Beat_3": 15,
      "Beat_4": 16,
      "Beat_5": 17,
      "Beat_6": 18,
      "Beat_7": 19,
      "Beat_8": 20,
      "Beat_9": 21,
      "Chord_A#_+": 22,
      "Chord_A#_/o7": 23,
      "Chord_A#_7": 24,
      "Chord_A#_M": 25,
      "Chord_A#_M7": 26,
      "Chord_A#_m": 27,
      "Chord_A#_m7": 28,
      "Chord_A#_o": 29,
      "Chord_A#_o7": 30,
      "Chord_A#_sus2": 31,
      "Chord_A#_sus4": 32,
      "Chord_A_+": 33,
      "Chord_A_/o7": 34,
      "Chord_A_7": 35,
      "Chord_A_M": 36,
      "Chord_A_M7": 37,
      "Chord_A_m": 38,
      "Chord_A_m7": 39,
      "Chord_A_o": 40,
      "Chord_A_o7": 41,
      "Chord_A_sus2": 42,
      "Chord_A_sus4": 43,
      "Chord_B_+": 44,
      "Chord_B_/o7": 45,
      "Chord_B_7": 46,
      "Chord_B_M": 47,
      "Chord_B_M7": 48,
      "Chord_B_m": 49,
      "Chord_B_m7": 50,
      "Chord_B_o": 51,
      "Chord_B_o7": 52,
      "Chord_B_sus2": 53,
      "Chord_B_sus4": 54,
      "Chord_C#_+": 55,
      "Chord_C#_/o7": 56,
      "Chord_C#_7": 57,
      "Chord_C#_M": 58,
      "Chord_C#_M7": 59,
      "Chord_C#_m": 60,
      "Chord_C#_m7": 61,
      "Chord_C#_o": 62,
      "Chord_C#_o7": 63,
      "Chord_C#_sus2": 64,
      "Chord_C#_sus4": 65,
      "Chord_C_+": 66,
      "Chord_C_/o7": 67,
      "Chord_C_7": 68,
      "Chord_C_M": 69,
      "Chord_C_M7": 70,
      "Chord_C_m": 71,
      "Chord_C_m7": 72,
      "Chord_C_o": 73,
      "Chord_C_o7": 74,
      "Chord_C_sus2": 75,
      "Chord_C_sus4": 76,
      "Chord_D#_+": 77,
      "Chord_D#_/o7": 78,
      "Chord_D#_7": 79,
      "Chord_D#_M": 80,
      "Chord_D#_M7": 81,
      "Chord_D#_m": 82,
      "Chord_D#_m7": 83,
      "Chord_D#_o": 84,
      "Chord_D#_o7": 85,
      "Chord_D#_sus2": 86,
      "Chord_D#_sus4": 87,
      "Chord_D_+": 88,
      "Chord_D_/o7": 89,
      "Chord_D_7": 90,
      "Chord_D_M": 91,
      "Chord_D_M7": 92,
      "Chord_D_m": 93,
      "Chord_D_m7": 94,
      "Chord_D_o": 95,
      "Chord_D_o7": 96,
      "Chord_D_sus2": 97,
      "Chord_D_sus4": 98,
      "Chord_E_+": 99,
      "Chord_E_/o7": 100,
      "Chord_E_7": 101,
      "Chord_E_M": 102,
      "Chord_E_M7": 103,
      "Chord_E_m": 104,
      "Chord_E_m7": 105,
      "Chord_E_o": 106,
      "Chord_E_o7": 107,
      "Chord_E_sus2": 108,
      "Chord_E_sus4": 109,
      "Chord_F#_+": 110,
      "Chord_F#_/o7": 111,
      "Chord_F#_7": 112,
      "Chord_F#_M": 113,
      "Chord_F#_M7": 114,
      "Chord_F#_m": 115,
      "Chord_F#_m7": 116,
      "Chord_F#_o": 117,
      "Chord_F#_o7": 118,
      "Chord_F#_sus2": 119,
      "Chord_F#_sus4": 120,
      "Chord_F_+": 121,
      "Chord_F_/o7": 122,
      "Chord_F_7": 123,
      "Chord_F_M": 124,
      "Chord_F_M7": 125,
      "Chord_F_m": 126,
      "Chord_F_m7": 127,
      "Chord_F_o": 128,
      "Chord_F_o7": 129,
      "Chord_F_sus2": 130,
      "Chord_F_sus4": 131,
      "Chord_G#_+": 132,
      "Chord_G#_/o7": 133,
      "Chord_G#_7": 134,
      "Chord_G#_M": 135,
      "Chord_G#_M7": 136,
      "Chord_G#_m": 137,
      "Chord_G#_m7": 138,
      "Chord_G#_o": 139,
      "Chord_G#_o7": 140,
      "Chord_G#_sus2": 141,
      "Chord_G#_sus4": 142,
      "Chord_G_+": 143,
      "Chord_G_/o7": 144,
      "Chord_G_7": 145,
      "Chord_G_M": 146,
      "Chord_G_M7": 147,
      "Chord_G_m": 148,
      "Chord_G_m7": 149,
      "Chord_G_o": 150,
      "Chord_G_o7": 151,
      "Chord_G_sus2": 152,
      "Chord_G_sus4": 153,
      "Chord_N_N": 154,
      "EOS_None": 155,
      "Note_Duration_0": 156,
      "Note_Duration_1080": 157,
      "Note_Duration_120": 158,
      "Note_Duration_1200": 159,
      "Note_Duration_1320": 160,
      "Note_Duration_1440": 161,
      "Note_Duration_1560": 162,
      "Note_Duration_1680": 163,
      "Note_Duration_1800": 164,
      "Note_Duration_1920": 165,
      "Note_Duration_240": 166,
      "Note_Duration_360": 167,
      "Note_Duration_480": 168,
      "Note_Duration_600": 169,
      "Note_Duration_720": 170,
      "Note_Duration_840": 171,
      "Note_Duration_960": 172,
      "Note_Pitch_100": 173,
      "Note_Pitch_101": 174,
      "Note_Pitch_102": 175,
      "Note_Pitch_103": 176,
      "Note_Pitch_104": 177,
      "Note_Pitch_105": 178,
      "Note_Pitch_22": 179,
      "Note_Pitch_23": 180,
      "Note_Pitch_24": 181,
      "Note_Pitch_25": 182,
      "Note_Pitch_26": 183,
      "Note_Pitch_27": 184,
      "Note_Pitch_28": 185,
      "Note_Pitch_29": 186,
      "Note_Pitch_30": 187,
      "Note_Pitch_31": 188,
      "Note_Pitch_32": 189,
      "Note_Pitch_33": 190,
      "Note_Pitch_34": 191,
      "Note_Pitch_35": 192,
      "Note_Pitch_36": 193,
      "Note_Pitch_37": 194,
      "Note_Pitch_38": 195,
      "Note_Pitch_39": 196,
      "Note_Pitch_40": 197,
      "Note_Pitch_41": 198,
      "Note_Pitch_42": 199,
      "Note_Pitch_43": 200,
      "Note_Pitch_44": 201,
      "Note_Pitch_45": 202,
      "Note_Pitch_46": 203,
      "Note_Pitch_47": 204,
      "Note_Pitch_48": 205,
      "Note_Pitch_49": 206,
      "Note_Pitch_50": 207,
      "Note_Pitch_51": 208,
      "Note_Pitch_52": 209,
      "Note_Pitch_53": 210,
      "Note_Pitch_54": 211,
      "Note_Pitch_55": 212,
      "Note_Pitch_56": 213,
      "Note_Pitch_57": 214,
      "Note_Pitch_58": 215,
      "Note_Pitch_59": 216,
      "Note_Pitch_60": 217,
      "Note_Pitch_61": 218,
      "Note_Pitch_62": 219,
      "Note_Pitch_63": 220,
      "Note_Pitch_64": 221,
      "Note_Pitch_65": 222,
      "Note_Pitch_66": 223,
      "Note_Pitch_67": 224,
      "Note_Pitch_68": 225,
      "Note_Pitch_69": 226,
      "Note_Pitch_70": 227,
      "Note_Pitch_71": 228,
      "Note_Pitch_72": 229,
      "Note_Pitch_73": 230,
      "Note_Pitch_74": 231,
      "Note_Pitch_75": 232,
      "Note_Pitch_76": 233,
      "Note_Pitch_77": 234,
      "Note_Pitch_78": 235,
      "Note_Pitch_79": 236,
      "Note_Pitch_80": 237,
      "Note_Pitch_81": 238,
      "Note_Pitch_82": 239,
      "Note_Pitch_83": 240,
      "Note_Pitch_84": 241,
      "Note_Pitch_85": 242,
      "Note_Pitch_86": 243,
      "Note_Pitch_87": 244,
      "Note_Pitch_88": 245,
      "Note_Pitch_89": 246,
      "Note_Pitch_90": 247,
      "Note_Pitch_91": 248,
      "Note_Pitch_92": 249,
      "Note_Pitch_93": 250,
      "Note_Pitch_94": 251,
      "Note_Pitch_95": 252,
      "Note_Pitch_96": 253,
      "Note_Pitch_97": 254,
      "Note_Pitch_98": 255,
      "Note_Pitch_99": 256,
      "Note_Velocity_100": 257,
      "Note_Velocity_102": 258,
      "Note_Velocity_104": 259,
      "Note_Velocity_106": 260,
      "Note_Velocity_108": 261,
      "Note_Velocity_110": 262,
      "Note_Velocity_112": 263,
      "Note_Velocity_114": 264,
      "Note_Velocity_40": 265,
      "Note_Velocity_42": 266,
      "Note_Velocity_44": 267,
      "Note_Velocity_46": 268,
      "Note_Velocity_48": 269,
      "Note_Velocity_50": 270,
      "Note_Velocity_52": 271,
      "Note_Velocity_54": 272,
      "Note_Velocity_56": 273,
      "Note_Velocity_58": 274,
      "Note_Velocity_60": 275,
      "Note_Velocity_62": 276,
      "Note_Velocity_64": 277,
      "Note_Velocity_66": 278,
      "Note_Velocity_68": 279,
      "Note_Velocity_70": 280,
      "Note_Velocity_72": 281,
      "Note_Velocity_74": 282,
      "Note_Velocity_76": 283,
      "Note_Velocity_78": 284,
      "Note_Velocity_80": 285,
      "Note_Velocity_82": 286,
      "Note_Velocity_84": 287,
      "Note_Velocity_86": 288,
      "Note_Velocity_88": 289,
      "Note_Velocity_90": 290,
      "Note_Velocity_92": 291,
      "Note_Velocity_94": 292,
      "Note_Velocity_96": 293,
      "Note_Velocity_98": 294,
      "Tempo_104": 295,
      "Tempo_107": 296,
      "Tempo_113": 297,
      "Tempo_116": 298,
      "Tempo_119": 299,
      "Tempo_122": 300,
      "Tempo_128": 301,
      "Tempo_137": 302,
      "Tempo_143": 303,
      "Tempo_152": 304,
      "Tempo_161": 305,
      "Tempo_173": 306,
      "Tempo_185": 307,
      "Tempo_200": 308,
      "Tempo_215": 309,
      "Tempo_32": 310,
      "Tempo_35": 311,
      "Tempo_38": 312,
      "Tempo_41": 313,
      "Tempo_44": 314,
      "Tempo_47": 315,
      "Tempo_50": 316,
      "Tempo_53": 317,
      "Tempo_56": 318,
      "Tempo_59": 319,
      "Tempo_62": 320,
      "Tempo_65": 321,
      "Tempo_68": 322,
      "Tempo_71": 323,
      "Tempo_74": 324,
      "Tempo_77": 325,
      "Tempo_80": 326,
      "Tempo_83": 327,
      "Tempo_86": 328,
      "Tempo_89": 329,
      "Tempo_92": 330,
      "Tempo_95": 331,
      "Tempo_98": 332,
      "Track_Midi": 333,
      "Track_Skyline": 334,
      "Note_Pitch_21": 335,
      "Note_Pitch_106": 336,
      "Note_Pitch_107": 337,
      "Note_Pitch_108": 338,
      "Tempo_101": 339,
      "Tempo_110": 340,
      "Tempo_125": 341,
      "Tempo_131": 342,
      "Tempo_134": 343,
      "Tempo_140": 344,
      "Tempo_146": 345,
      "Tempo_149": 346,
      "Tempo_155": 347,
      "Tempo_158": 348,
      "Tempo_164": 349,
      "Tempo_167": 350,
      "Tempo_170": 351,
      "Tempo_176": 352,
      "Tempo_179": 353,
      "Tempo_182": 354,
      "Tempo_188": 355,
      "Tempo_191": 356,
      "Tempo_194": 357,
      "Tempo_197": 358,
      "Tempo_203": 359,
      "Tempo_206": 360,
      "Tempo_209": 361,
      "Tempo_212": 362,
      "Tempo_218": 363,
      "Tempo_221": 364,
      "Tempo_224": 365,
      "[UNK]": 366
    },
    "unk_token": "[UNK]"
  }
}